cases/openfoam/fluids/naca0012_subsonic/solution/case/0/U
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions [0 1 -1 0 0 0 0];

internalField uniform (30 0 0);

boundaryField
{
    inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (30 0 0);
        value           uniform (30 0 0);
    }
    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (30 0 0);
        value           uniform (30 0 0);
    }
    top
    {
        type            freestreamVelocity;
        freestreamValue uniform (30 0 0);
        value           uniform (30 0 0);
    }
    bottom
    {
        type            freestreamVelocity;
        freestreamValue uniform (30 0 0);
        value           uniform (30 0 0);
    }
    airfoil
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            slip;
    }
}
