cases/openfoam/fluids/naca0012_subsonic/solution/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// NACA 0012 Ladson conditions: M=0.15, Re_c = 6e6
// With c=1, U=30: nu = U*c/Re = 30/6e6 = 5e-6

transportModel  Newtonian;
nu              5e-06;
