cases/openfoam/fluids/naca0012_subsonic/solution/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         3000;

deltaT          1;

writeControl    timeStep;
writeInterval   500;

purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    forces1
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   100;

        patches         (airfoil);
        rho             rhoInf;
        rhoInf          1.225;
        CofR            (0.25 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         30.0;
        lRef            1.0;
        Aref            0.1;       // chord * span (0.1 m thick slab)
    }

    wakeSample
    {
        type            sets;
        libs            (sampling);
        writeControl    writeTime;
        interpolationScheme cellPoint;
        setFormat       raw;
        fields          (U);
        sets
        {
            wake_x1p05
            {
                type    uniform;
                axis    y;
                start   (1.05 -0.5 0);
                end     (1.05  0.5 0);
                nPoints 200;
            }
            wake_x1p40
            {
                type    uniform;
                axis    y;
                start   (1.40 -0.5 0);
                end     (1.40  0.5 0);
                nPoints 200;
            }
            wake_x3p00
            {
                type    uniform;
                axis    y;
                start   (3.00 -0.5 0);
                end     (3.00  0.5 0);
                nPoints 200;
            }
        }
    }
}
