cases/openfoam/fluids/naca0012_subsonic/solution/case/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// After snappyHexMesh, ensure frontAndBack stays of type empty so
// simpleFoam treats the slab as 2D.

pointSync false;

patches
(
    {
        name            frontAndBack;
        patchInfo
        {
            type        empty;
        }
        constructFrom   patches;
        patches         (frontAndBack);
    }
);
