cases/openfoam/fluids/naca0012_subsonic/solution/case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    airfoil
    {
        type triSurfaceMesh;
        file "airfoil.obj";
    }
    nearbox
    {
        type searchableBox;
        min  (-2.0 -2.0 -1);
        max  ( 4.0  2.0  1);
    }
    wakebox
    {
        type searchableBox;
        min  (-0.05 -0.5 -1);
        max  ( 6.0   0.5  1);
    }
}

castellatedMeshControls
{
    maxLocalCells   500000;
    maxGlobalCells  1500000;
    minRefinementCells 10;
    nCellsBetweenLevels 2;

    features ();

    refinementSurfaces
    {
        airfoil
        {
            level (4 5);
            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        nearbox
        {
            mode    inside;
            levels  ((1 2));
        }
        wakebox
        {
            mode    inside;
            levels  ((1 3));
        }
    }

    locationInMesh (-30 30 0);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch     5;
    tolerance        2.0;
    nSolveIter       30;
    nRelaxIter       5;
    nFeatureSnapIter 10;
    implicitFeatureSnap true;
    explicitFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        airfoil
        {
            nSurfaceLayers 3;
        }
    }
    expansionRatio        1.3;
    finalLayerThickness   0.5;
    minThickness          0.05;
    nGrow                 0;
    featureAngle          120;
    nRelaxIter            3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals        3;
    nSmoothThickness      10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle    90;
    nBufferCellsNoExtrude 0;
    nLayerIter            30;
}

meshQualityControls
{
    maxNonOrtho 70;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       -1;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;
}

mergeTolerance 1e-6;
